experiments/d3000-pkvm-apps/results/d3000-apps-never-20260714-100618/pair-3/nvhe/redis-r1-steady/rep-01/memtier.txt
4         Threads
25        Connections per thread
300       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets         8545.78          ---          ---         0.69443         0.71900         0.80700         1.43100         1.49500      8894.97 
Gets        85456.00     85456.00         0.00         0.68600         0.71100         0.77500         1.42300         1.48700     88530.51 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals      94001.78     85456.00         0.00         0.68676         0.71100         0.77500         1.42300         1.48700     97425.48 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.343        5.000
SET       0.567       10.000
SET       0.663       15.000
SET       0.679       20.000
SET       0.687       25.000
SET       0.695       30.000
SET       0.703       35.000
SET       0.711       40.000
SET       0.711       45.000
SET       0.719       50.000
SET       0.719       52.500
SET       0.719       55.000
SET       0.727       57.500
SET       0.727       60.000
SET       0.727       62.500
SET       0.727       65.000
SET       0.727       67.500
SET       0.735       70.000
SET       0.735       72.500
SET       0.735       75.000
SET       0.735       76.250
SET       0.735       77.500
SET       0.743       78.750
SET       0.743       80.000
SET       0.743       81.250
SET       0.743       82.500
SET       0.743       83.750
SET       0.743       85.000
SET       0.743       86.250
SET       0.751       87.500
SET       0.751       88.125
SET       0.751       88.750
SET       0.751       89.375
SET       0.751       90.000
SET       0.751       90.625
SET       0.759       91.250
SET       0.759       91.875
SET       0.759       92.500
SET       0.767       93.125
SET       0.775       93.750
SET       0.775       94.062
SET       0.783       94.375
SET       0.791       94.688
SET       0.807       95.000
SET       0.823       95.312
SET       0.847       95.625
SET       0.863       95.938
SET       0.895       96.250
SET       0.927       96.562
SET       0.959       96.875
SET       0.967       97.031
SET       0.983       97.188
SET       0.999       97.344
SET       1.023       97.500
SET       1.119       97.656
SET       1.263       97.812
SET       1.319       97.969
SET       1.351       98.125
SET       1.367       98.281
SET       1.383       98.438
SET       1.391       98.516
SET       1.399       98.594
SET       1.407       98.672
SET       1.415       98.750
SET       1.415       98.828
SET       1.423       98.906
SET       1.431       98.984
SET       1.431       99.062
SET       1.439       99.141
SET       1.439       99.219
SET       1.447       99.258
SET       1.447       99.297
SET       1.447       99.336
SET       1.447       99.375
SET       1.455       99.414
SET       1.455       99.453
SET       1.455       99.492
SET       1.455       99.531
SET       1.463       99.570
SET       1.463       99.609
SET       1.463       99.629
SET       1.463       99.648
SET       1.463       99.668
SET       1.471       99.688
SET       1.471       99.707
SET       1.471       99.727
SET       1.471       99.746
SET       1.471       99.766
SET       1.479       99.785
SET       1.479       99.805
SET       1.479       99.814
SET       1.479       99.824
SET       1.479       99.834
SET       1.479       99.844
SET       1.487       99.854
SET       1.487       99.863
SET       1.487       99.873
SET       1.487       99.883
SET       1.487       99.893
SET       1.495       99.902
SET       1.495       99.907
SET       1.495       99.912
SET       1.495       99.917
SET       1.495       99.922
SET       1.503       99.927
SET       1.503       99.932
SET       1.503       99.937
SET       1.511       99.941
SET       1.511       99.946
SET       1.519       99.951
SET       1.519       99.954
SET       1.519       99.956
SET       1.527       99.958
SET       1.527       99.961
SET       1.527       99.963
SET       1.535       99.966
SET       1.535       99.968
SET       1.543       99.971
SET       1.543       99.973
SET       1.551       99.976
SET       1.551       99.977
SET       1.559       99.978
SET       1.559       99.979
SET       1.567       99.980
SET       1.567       99.982
SET       1.575       99.983
SET       1.575       99.984
SET       1.583       99.985
SET       1.583       99.987
SET       1.591       99.988
SET       1.591       99.988
SET       1.591       99.989
SET       1.591       99.990
SET       1.599       99.990
SET       1.599       99.991
SET       1.607       99.991
SET       1.607       99.992
SET       1.615       99.993
SET       1.631       99.993
SET       1.655       99.994
SET       1.671       99.994
SET       1.695       99.995
SET       1.711       99.995
SET       1.727       99.995
SET       1.775       99.995
SET       1.807       99.996
SET       1.863       99.996
SET       1.943       99.996
SET       2.023       99.997
SET       2.063       99.997
SET       2.111       99.997
SET       2.111       99.997
SET       2.127       99.997
SET       2.159       99.998
SET       2.159       99.998
SET       2.175       99.998
SET       2.191       99.998
SET       2.207       99.998
SET       2.223       99.998
SET       2.255       99.998
SET       2.287       99.999
SET       2.399       99.999
SET       2.495       99.999
SET       4.607       99.999
SET       4.639       99.999
SET       4.639       99.999
SET       4.639       99.999
[...]
SET       4.639      100.000
SET       4.639      100.000
SET       4.639      100.000
[...]
SET       5.343      100.000
SET       5.343      100.000
SET       5.343      100.000
[...]
SET       6.783      100.000
SET       6.783      100.000
SET       6.783      100.000
[...]
SET       6.815      100.000
SET       6.815      100.000
---
GET       0.023        0.000
GET       0.327        5.000
GET       0.559       10.000
GET       0.663       15.000
GET       0.671       20.000
GET       0.687       25.000
GET       0.695       30.000
GET       0.695       35.000
GET       0.703       40.000
GET       0.711       45.000
GET       0.711       50.000
GET       0.711       52.500
GET       0.719       55.000
GET       0.719       57.500
GET       0.719       60.000
GET       0.719       62.500
GET       0.719       65.000
GET       0.727       67.500
GET       0.727       70.000
GET       0.727       72.500
GET       0.727       75.000
GET       0.727       76.250
GET       0.727       77.500
GET       0.727       78.750
GET       0.735       80.000
GET       0.735       81.250
GET       0.735       82.500
GET       0.735       83.750
GET       0.735       85.000
GET       0.735       86.250
GET       0.735       87.500
GET       0.743       88.125
GET       0.743       88.750
GET       0.743       89.375
GET       0.743       90.000
GET       0.743       90.625
GET       0.743       91.250
GET       0.743       91.875
GET       0.751       92.500
GET       0.751       93.125
GET       0.751       93.750
GET       0.759       94.062
GET       0.759       94.375
GET       0.767       94.688
GET       0.775       95.000
GET       0.791       95.312
GET       0.807       95.625
GET       0.823       95.938
GET       0.839       96.250
GET       0.863       96.562
GET       0.903       96.875
GET       0.927       97.031
GET       0.943       97.188
GET       0.959       97.344
GET       0.983       97.500
GET       1.015       97.656
GET       1.135       97.812
GET       1.279       97.969
GET       1.327       98.125
GET       1.351       98.281
GET       1.367       98.438
GET       1.383       98.516
GET       1.391       98.594
GET       1.399       98.672
GET       1.399       98.750
GET       1.407       98.828
GET       1.415       98.906
GET       1.423       98.984
GET       1.423       99.062
GET       1.431       99.141
GET       1.439       99.219
GET       1.439       99.258
GET       1.439       99.297
GET       1.439       99.336
GET       1.447       99.375
GET       1.447       99.414
GET       1.447       99.453
GET       1.455       99.492
GET       1.455       99.531
GET       1.455       99.570
GET       1.455       99.609
GET       1.463       99.629
GET       1.463       99.648
GET       1.463       99.668
GET       1.463       99.688
GET       1.463       99.707
GET       1.463       99.727
GET       1.471       99.746
GET       1.471       99.766
GET       1.471       99.785
GET       1.471       99.805
GET       1.471       99.814
GET       1.479       99.824
GET       1.479       99.834
GET       1.479       99.844
GET       1.479       99.854
GET       1.479       99.863
GET       1.479       99.873
GET       1.487       99.883
GET       1.487       99.893
GET       1.487       99.902
GET       1.487       99.907
GET       1.487       99.912
GET       1.495       99.917
GET       1.495       99.922
GET       1.495       99.927
GET       1.495       99.932
GET       1.495       99.937
GET       1.503       99.941
GET       1.503       99.946
GET       1.511       99.951
GET       1.511       99.954
GET       1.511       99.956
GET       1.511       99.958
GET       1.519       99.961
GET       1.519       99.963
GET       1.527       99.966
GET       1.527       99.968
GET       1.535       99.971
GET       1.535       99.973
GET       1.543       99.976
GET       1.543       99.977
GET       1.551       99.978
GET       1.551       99.979
GET       1.559       99.980
GET       1.559       99.982
GET       1.559       99.983
GET       1.567       99.984
GET       1.567       99.985
GET       1.575       99.987
GET       1.575       99.988
GET       1.583       99.988
GET       1.583       99.989
GET       1.583       99.990
GET       1.591       99.990
GET       1.591       99.991
GET       1.599       99.991
GET       1.599       99.992
GET       1.607       99.993
GET       1.615       99.993
GET       1.623       99.994
GET       1.631       99.994
GET       1.647       99.995
GET       1.663       99.995
GET       1.687       99.995
GET       1.727       99.995
GET       1.783       99.996
GET       1.831       99.996
GET       1.903       99.996
GET       1.975       99.997
GET       2.047       99.997
GET       2.095       99.997
GET       2.127       99.997
GET       2.143       99.997
GET       2.175       99.998
GET       2.191       99.998
GET       2.223       99.998
GET       2.287       99.998
GET       3.119       99.998
GET       4.639       99.998
GET       4.703       99.998
GET       4.703       99.999
GET       4.703       99.999
GET       4.703       99.999
GET       4.735       99.999
GET       4.767       99.999
GET       4.767       99.999
GET       4.767       99.999
GET       4.895       99.999
GET       4.927       99.999
GET       5.311       99.999
GET       5.311       99.999
GET       5.311       99.999
[...]
GET       5.311      100.000
GET       5.311      100.000
GET       5.343      100.000
GET       6.047      100.000
GET       6.751      100.000
GET       6.783      100.000
GET       6.783      100.000
GET       6.783      100.000
[...]
GET       6.815      100.000
GET       6.815      100.000
GET       6.815      100.000
[...]
GET       7.487      100.000
GET       7.487      100.000
GET       7.487      100.000
[...]
GET       7.519      100.000
GET       7.519      100.000
---
WAIT      0.000      100.000